
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ТаблицаСчетов = Объект.ТаблицаСчетов;
	
	ВыборкаСчетов = ПланыСчетов.Хозрасчетный.Выбрать();
	
	Пока ВыборкаСчетов.Следующий() Цикл
		
		Если ТаблицаСчетов.НайтиСтроки(Новый Структура("Код", ВыборкаСчетов.Код)).Количество() = 0 Тогда
			НоваяСтрока=ТаблицаСчетов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСчетов);
			
			Если НоваяСтрока.Вид="Активный" Тогда НоваяСТрока.Дт=Истина; 
			ИначеЕсли НоваяСтрока.Вид="Пассивный" Тогда НоваяСтрока.Кт=Истина;
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТаблицаСчетов = Объект.ТаблицаСчетов;
	
	Сч = 0;
	
	Пока Сч < ТаблицаСчетов.Количество() Цикл
		СтрокаТаблицы = ТаблицаСчетов.Получить(Сч);
		
		Если СтрокаТаблицы.Выбрать<>Истина ИЛИ ((СтрокаТаблицы.Дт=Ложь И СтрокаТаблицы.Кт=Ложь) ИЛИ (СтрокаТаблицы.Дт=Истина И СтрокаТаблицы.Кт=Истина) ) Тогда

			ТаблицаСчетов.Удалить(СтрокаТаблицы);
		Иначе 
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Закрыть(ТаблицаСчетов);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТаблицаСчетов") Тогда
		ТаблицаСчетов = Параметры.ТаблицаСчетов; 
        Объект.ТаблицаСчетов.Загрузить(Параметры.ТаблицаСчетов.Выгрузить());
    КонецЕсли;
КонецПроцедуры