&НаСервере
Функция ПодготовитьТабФормат() Экспорт
	ТабФормат = Новый ТаблицаЗначений;
	ТабФормат.Колонки.Добавить("ИД");
	ТабФормат.Колонки.Добавить("Имя");
	ТабФормат.Колонки.Добавить("Ширина");
	ТабФормат.Колонки.Добавить("ТолщинаЛинии");
	ТолщинаЛинииПоУмолчанию=1;
	// Задаем "№ пп" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"НомерСтр";	
	СтрТаб.Имя = 			"№ пп";	
	СтрТаб.Ширина = 			514;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Дата" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Дата";	
	СтрТаб.Имя = 			"Дата";	
	СтрТаб.Ширина = 			1600;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Документ" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Документ";	
	СтрТаб.Имя = 			"Документ";	
	СтрТаб.Ширина = 			4400;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Содержание" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Содержание";	
	СтрТаб.Имя = 			"Содержание";	
	СтрТаб.Ширина = 			2500;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Дебет" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"СчетДт";	
	СтрТаб.Имя = 			"Дебет";	
	СтрТаб.Ширина = 			843;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Аналитика Дт." 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"АналитикаДт";	
	СтрТаб.Имя = 			"Аналитика Дт.";	
	СтрТаб.Ширина = 			2957;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Кредит" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"СчетКт";	
	СтрТаб.Имя = 			"Кредит";	
	СтрТаб.Ширина = 			843;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Аналитика Кт." 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"АналитикаКт";	
	СтрТаб.Имя = 			"Аналитика Кт.";	
	СтрТаб.Ширина = 			2957;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Сумма" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Сумма";	
	СтрТаб.Имя = 			"Сумма";	
	СтрТаб.Ширина = 			1371;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Кол-во" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Количество";	
	СтрТаб.Имя = 			"Кол-во";	
	СтрТаб.Ширина = 			843;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	// Задаем "Признак" 
	СтрТаб = ТабФормат.Добавить();
	СтрТаб.ИД = 				"Признак";	
	СтрТаб.Имя = 			"Признак";	
	СтрТаб.Ширина = 			843;
	СтрТаб.ТолщинаЛинии =	ТолщинаЛинииПоУмолчанию;
	
	Возврат ТабФормат;
КонецФункции
